10-import-export.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-24 Wed 16:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Importing and Exporting</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="highlight/styles/vs2015.css">
</head>
<body>
<div id="content">
<h1 class="title">Importing and Exporting</h1>
<p>
<b><a href="index.html">Home</a></b>
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org95284ae">1. Importing and Exporting</a>
<ul>
<li><a href="#orgb6399d6">1.1. Exporting</a></li>
<li><a href="#org04c9cb7">1.2. Importing</a></li>
<li><a href="#orgedfe434">1.3. Built-in Modules</a></li>
<li><a href="#org66fe7c9">1.4. Packages</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org95284ae" class="outline-2">
<h2 id="org95284ae"><span class="section-number-2">1</span> Importing and Exporting</h2>
<div class="outline-text-2" id="text-1">
<p>
Whether we're writing code to be run in web browsers, the console, or anywhere else, having a system for sharing code between files is essential for building projects. Imagine needing to write and read thousands of lines of code in a single file, or using multiple files but needing to copy functions to every file where they need to be used. What horror! This lesson is about the import and export system specifically with <a href="https://nodejs.org">Node.js</a>, familiarly known as 'node', and <a href="https://www.npmjs.com/">npm</a>.
</p>
</div>

<div id="outline-container-orgb6399d6" class="outline-3">
<h3 id="orgb6399d6"><span class="section-number-3">1.1</span> Exporting</h3>
<div class="outline-text-3" id="text-1-1">
<p>
JavaScript code in our files is never automatically <b>exported</b>. In order to be able to share code from one file to another, we need to explicitly write which code can be shared. Every JavaScript file that is run with node has a hidden variable called <code>module.exports</code>. If we don't explicitly set this variable to any value, its value is an empty object <code>{}</code>. Whatever value we give to <code>module.exports</code> is what the file is exporting (meaning it can be imported by another file). (The reason for the name <code>module.exports</code> is because node considers every JavaScript file a <b>module</b>.) It is most common to export an object because, as we've seen, objects allow us to package many things into one value.
</p>

<p>
Let's look at an example.
</p>

<div class="org-src-container">
<pre class="src src-js">const a = 1;
const b = 2;

module.exports = {
  c: 3
};
</pre>
</div>

<p>
If we have a file with the above code, the file is exporting an object with a single property <code>c: 3</code>. The variables <code>a</code> and <code>b</code> are not being exported, thus they cannot be shared with any other file. If we want to share them, we can add them to the exports as well:
</p>

<div class="org-src-container">
<pre class="src src-js">const a = 1;
const b = 2;

module.exports = {
  a: a,
  b: b,
  c: 3
};
</pre>
</div>

<p>
It is common to use a shorthand notation in the object for this.
</p>

<div class="org-src-container">
<pre class="src src-js">const a = 1;
const b = 2;

module.exports = {
  a,
  b,
  c: 3
};
</pre>
</div>
</div>
</div>

<div id="outline-container-org04c9cb7" class="outline-3">
<h3 id="org04c9cb7"><span class="section-number-3">1.2</span> Importing</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The special function for <b>importing</b> a module in node is <code>require()</code>. We pass it the name of a module (a JavaScript file) and it runs that module, then retrieves the <code>module.exports</code> value of that module. Note that if you have any <code>console.log</code>  in the imported module, it will be printed even if you don't run the file directly. Now we can look at complete examples. Keep in mind that if you want to try these examples out, you will have to create separate files (suggested file names are given).
</p>

<div class="org-src-container">
<pre class="src src-js">// inside numbers.js:
const a = 1;
const b = 2;

module.exports = {
  a,
  b,
  c: 3
};

// inside index.js:
const someNumbers = require('./numbers.js');

console.log(someNumbers.a); // 1
console.log(someNumbers.b); // 2
console.log(someNumbers.c); // 3
</pre>
</div>

<p>
In the above example, we want to run the <code>index.js</code> file, since running <code>numbers.js</code> will not produce any output. So we run the command: <code>node index.js</code>. (The name "index" is commonly used, for historical reasons.) It is important in this example that we write <code>require('./numbers.js')</code> instead of <code>require('numbers.js')</code> because we want to import a local file; the latter tells node to import an external package, which is explained in the next section.
</p>

<p>
Object destructuring is commonly used when importing because it skips the step of needing to give the export object a name and also allows us to selectively import properties.
</p>

<div class="org-src-container">
<pre class="src src-js">// inside numbers.js:
const a = 1;
const b = 2;

module.exports = {
  a,
  b,
  c: 3
};

// inside index.js:
const {a, c} = require('./numbers.js'); // Import a and b from the numbers module

console.log(a); // 1
console.log(c); // 3
</pre>
</div>

<p>
Finally, let's look at a more realistic example: sharing a little library of functions.
</p>

<div class="org-src-container">
<pre class="src src-js">//inside functions.js:
const fToC = ftemp =&gt; (ftemp - 32) / 1.8;
const cToF = ctemp =&gt; (ctemp * 1.8) + 32;

const convertTemperature = (temp, conv) =&gt; {
  if (conv === 'FtoC') {
    return fToC(temp);
  } else {
    return cToF(temp);
  }
};

const isEven = x =&gt; x % 2 === 0;
const isOdd = (x) =&gt; !isEven(x);

module.exports = {
  convertTemperature,
  isEven,
  isOdd
};

// inside index.js:
const {
  isEven,
  convertTemperature
} = require('./functions.js');

const x = 24;

if (isEven(x)) {
  console.log(convertTemperature(x, 'CtoF')); // 75.2
}
</pre>
</div>

<p>
It is considered good practice to put exports at the bottom of a file and imports at the top of a file.
</p>
</div>
</div>

<div id="outline-container-orgedfe434" class="outline-3">
<h3 id="orgedfe434"><span class="section-number-3">1.3</span> Built-in Modules</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Now that we've seen how to import code from a module that we created, let's look at importing code from a module that we own but didn't create. Node.js comes with some built-in modules that are available for us to use but only if we import them. One such example is the <code>fs</code> module, for dealing with the file system. Importing a built-in module is the same as importing a module that we created, except the argument we give to <code>require()</code> should only have the exact name of the module; node knows where to look for built-in modules on our system.
</p>

<div class="org-src-container">
<pre class="src src-js">const {readFileSync} = require('fs'); // No dots of slashes before the module name

const fileContents = readFileSync('my-test-file.txt', 'utf8'); // Read the contents of a file
console.log(fileContents); // Print the file's contents
</pre>
</div>

<p>
The above example will read the contents of a file named <code>my-test-file.txt</code> that exists in the same directory as the JavaScript file we're running this code from, then print it out.
</p>
</div>
</div>

<div id="outline-container-org66fe7c9" class="outline-3">
<h3 id="org66fe7c9"><span class="section-number-3">1.4</span> Packages</h3>
<div class="outline-text-3" id="text-1-4">
<p>
A <b>package</b> is a collection of modules that are packaged together to solve a single problem, such as adding colors to output in the terminal. Its purpose is to be imported into a project to add some specific functionality. In the JavaScript ecosystem, virtually all packages are found at <a href="https://www.npmjs.com/">https://www.npmjs.com/</a>. Node.js comes with npm, the "Node Package Manager" (so if you have the <code>node</code> command, you should also have <code>npm</code>).
</p>

<p>
Before we can start to use packages with npm, we need to set up a project directory as recognized by npm:
</p>

<ol class="org-ol">
<li>Create a new directory.</li>
<li>Navigate to the directory in a terminal.</li>
<li>In the terminal, enter the command <code>npm init</code>. Keep pressing <code>enter/return</code> for all of the prompts. (The default for every option is fine.)</li>
<li>Create a file called <code>index.js</code>. This will be the main file of the project.</li>
</ol>

<p>
npm should have created a <code>package.json</code> file. This contains information about our new project, including the packages that it uses (none yet).
</p>

<p>
Let's try using the chalk package at <a href="https://www.npmjs.com/package/chalk">https://www.npmjs.com/package/chalk</a>. The package's page has information written by the owner of the package. Don't expect this to always be pretty or helpful; it is completely up to the individual what is written here, sort of like a blog post. To install the package, we enter the terminal command <code>npm install &lt;package_name&gt;</code>. So to install the chalk package in our project, we would make sure our terminal is in the project directory then enter the command <code>npm install chalk</code>. This will do a few things for us:
</p>

<ul class="org-ul">
<li>Download the package's code.</li>
<li>Create a <code>node_modules</code> directory within our project directory (if it does not already exist).</li>
<li>Put the package's code inside <code>node_modules</code>.</li>
<li>Add the package name to the <code>package.json</code> file.</li>
</ul>

<p>
Now that we have the package install, it is available for us to use! As per the chalk package's official example:
</p>

<div class="org-src-container">
<pre class="src src-js">const chalk = require('chalk'); // Import the chalk package
 
console.log(chalk.blue('Hello world!')); // Print a message in blue
</pre>
</div>

<p>
Putting that code in our <code>index.js</code> file and running it with <code>node index.js</code>, we should see a blue "Hello world!" in the terminal.
</p>

<p>
That's it! Try exploring <a href="https://www.npmjs.com/">npm</a> and playing around with more packages. You can install as many packages in a single project as you wish. You don't even need to use the ones you installed.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
